0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    inlet
	{
		type  fixedValue;
		value $internalField;
	}

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
/*
    "plane_zone(0|1|2)"
    {
        type            omegaWallFunction;
        value           $internalField;
    }
*/
    sides
    {
        type            slip;
    }
	
	propellerCW
    {
        type            omegaWallFunction;
        value           $internalField;
    }
	propellerCCW
    {
        type            omegaWallFunction;
        value           $internalField;
    }

	domain
    {
        type            overset;
		value			uniform 0;
    }
	domain_PropellerMesh_CCW
    {
        type            overset;
		value			uniform 0;
    }
	domain_PropellerMesh_CCW_PropellerMesh_CW
    {
        type            overset;
		value			uniform 0;
    }
}


// ************************************************************************* //
