system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
	cellDisplacement
    {
        solver          PCG;
        preconditioner  DIC;

        tolerance       1e-06;
        relTol          0;
        maxIter         100;
    }

    p
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }
	
	//yPsi
    //{
    //    solver          PBiCGStab;
    //    preconditioner  DILU;
    //    tolerance       1e-6;
    //    relTol          0;
    //}
	
	pFinal
    {
        $p;
        relTol          0;
    }
	
	pcorr
    {
        $pFinal;
        solver          PCG;
        preconditioner  DIC;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    Phi
    {
        $p;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
        nSweeps         1;
    }

    k
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.0001;
        nSweeps         1;
    }
	
	"(U|k|epsilon|omega)Final"
    {
        $U;
        tolerance       1e-6;
        relTol          0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    nCorrectors 1;
    consistent yes;
	pRefCell 0; 
    pRefValue 0; 
    residualControl
	{
		p		1e-6;
		U		1e-6;
		k		1e-9;
		omega		1e-9;
	}
}

PIMPLE
{
    momentumPredictor   false;
    correctPhi          false;  //true;
    oversetAdjustPhi    true;
    nOuterCorrectors    2;
    nCorrectors         4;
    nNonOrthogonalCorrectors 2;
    ddtCorr             true;
	turbOnFinalIterOnly yes;
	residualControl
	{
		p{		
			relTol			0;
			tolerance		1e-6;
		}
		
		U{		
			relTol			0;
			tolerance		1e-6;
		}
		k{		
			relTol			0;
			tolerance		1e-8;
		}
		epsilon{		
			relTol			0;
			tolerance		1e-8;
		}
	}

}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    fields
    {
        p               0.7;
    }
    equations
    {
        "U.*"               0.7;
        k               0.7;
        epsilon     0.7;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //7
